In [1]:
import re
import warnings
import numpy as np
import pandas as pd
warnings.filterwarnings('ignore')

In [2]:
emp_df = pd.read_csv("data/Emp_data.csv")
emp_df.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
5,499687,Patrick,34.86,58,12.02,72305,Macksburg
6,539712,Nancy,22.14,50,0.87,98189,Atlanta
7,380086,Carol,59.12,40,34.52,60918,Blanchester
8,477616,Frances,58.18,42,23.27,121587,Delmita
9,162402,Diana,29.73,60,3.44,43010,Eureka Springs

In [3]:
emp_df["First Name"].apply(lambda x:x.lower())

0         lois
1       brenda
2          joe
3        diane
4     benjamin
        ...
95        jose
96      harold
97      nicole
98     theresa
99       tammy
Name: First Name, Length: 100, dtype: object

In [4]:
for x in emp_df.iloc[:10:2, 1]:
    emp_df.iloc[:10:2, 1] = np.nan

In [5]:
emp_df[emp_df['First Name'].isna()]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,NaN,36.36,60,13.68,168251,Denver
2,428945,NaN,54.15,68,0.98,50155,Michigantown
4,193819,NaN,40.31,58,4.01,117642,Fremont
6,539712,NaN,22.14,50,0.87,98189,Atlanta
8,477616,NaN,58.18,42,23.27,121587,Delmita

# GroupBy

In [6]:
movies_data = pd.read_csv("data/movies_data.csv")
movies_data

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [7]:
movies_data.genre.unique()

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

In [8]:
movies_data[movies_data.genre == "Crime"]

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
21,8.7,City of God,R,Crime,130,"[u'Alexandre Rodrigues', u'Matheus Nachtergael..."
...,...,...,...,...,...,...
927,7.5,Brick,R,Crime,110,"[u'Joseph Gordon-Levitt', u'Lukas Haas', u'Emi..."
931,7.4,Mean Streets,R,Crime,112,"[u'Robert De Niro', u'Harvey Keitel', u'David ..."
950,7.4,Bound,R,Crime,108,"[u'Jennifer Tilly', u'Gina Gershon', u'Joe Pan..."
969,7.4,Law Abiding Citizen,R,Crime,109,"[u'Gerard Butler', u'Jamie Foxx', u'Leslie Bibb']"
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [9]:
movies_data[movies_data.genre.isin(['Crime'])]

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
21,8.7,City of God,R,Crime,130,"[u'Alexandre Rodrigues', u'Matheus Nachtergael..."
...,...,...,...,...,...,...
927,7.5,Brick,R,Crime,110,"[u'Joseph Gordon-Levitt', u'Lukas Haas', u'Emi..."
931,7.4,Mean Streets,R,Crime,112,"[u'Robert De Niro', u'Harvey Keitel', u'David ..."
950,7.4,Bound,R,Crime,108,"[u'Jennifer Tilly', u'Gina Gershon', u'Joe Pan..."
969,7.4,Law Abiding Citizen,R,Crime,109,"[u'Gerard Butler', u'Jamie Foxx', u'Leslie Bibb']"
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [10]:
movies_data.groupby('genre').get_group("Crime").head(5)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
21,8.7,City of God,R,Crime,130,"[u'Alexandre Rodrigues', u'Matheus Nachtergael..."

In [11]:
movies_data[movies_data.genre.isin(['Drama', "Crime"])]

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
...,...,...,...,...,...,...
969,7.4,Law Abiding Citizen,R,Crime,109,"[u'Gerard Butler', u'Jamie Foxx', u'Leslie Bibb']"
970,7.4,Wonder Boys,R,Drama,107,"[u'Michael Douglas', u'Tobey Maguire', u'Franc..."
972,7.4,Blue Valentine,NC-17,Drama,112,"[u'Ryan Gosling', u'Michelle Williams', u'John..."
973,7.4,The Cider House Rules,PG-13,Drama,126,"[u'Tobey Maguire', u'Charlize Theron', u'Micha..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [12]:
df = pd.DataFrame(np.random.randint(1,30, [6,4]), columns=["A", "B", "C", "D"])

In [13]:
df

    A   B   C   D
0  13  17   1  17
1   2   6  12  22
2  29  24  14  21
3   3  26   9   1
4  24  25   2  29
5  12  25  19  24

In [14]:
df.replace({28:'test'})

    A   B   C   D
0  13  17   1  17
1   2   6  12  22
2  29  24  14  21
3   3  26   9   1
4  24  25   2  29
5  12  25  19  24

In [15]:
df.replace({df.iloc[1:2:, 1].tolist()[0]: 'Updated'})

    A        B   C   D
0  13       17   1  17
1   2  Updated  12  22
2  29       24  14  21
3   3       26   9   1
4  24       25   2  29
5  12       25  19  24

In [16]:
df.iloc[1:2:, 1].tolist()[0]

6

In [17]:
df

    A   B   C   D
0  13  17   1  17
1   2   6  12  22
2  29  24  14  21
3   3  26   9   1
4  24  25   2  29
5  12  25  19  24

In [18]:
df.replace(df.iloc[1:4:1, 1].tolist(), 'new_val')

         A        B   C        D
0       13       17   1       17
1        2  new_val  12       22
2       29  new_val  14       21
3        3  new_val   9        1
4  new_val       25   2       29
5       12       25  19  new_val

In [19]:
df.iloc[1:4:1, 1] = "new"

In [20]:
df

    A    B   C   D
0  13   17   1  17
1   2  new  12  22
2  29  new  14  21
3   3  new   9   1
4  24   25   2  29
5  12   25  19  24

In [21]:
df.dropna(axis=1, thresh=5)

    A    B   C   D
0  13   17   1  17
1   2  new  12  22
2  29  new  14  21
3   3  new   9   1
4  24   25   2  29
5  12   25  19  24

In [22]:
df

    A    B   C   D
0  13   17   1  17
1   2  new  12  22
2  29  new  14  21
3   3  new   9   1
4  24   25   2  29
5  12   25  19  24

In [23]:
df.rename({0:"zero"})

       A    B   C   D
zero  13   17   1  17
1      2  new  12  22
2     29  new  14  21
3      3  new   9   1
4     24   25   2  29
5     12   25  19  24